In [2]:
import pandas as pd
import numpy as np

In [6]:
#1
data = pd.Series([0.1, 1.5, 2, 2.7, 3])
data

0    0.1
1    1.5
2    2.0
3    2.7
4    3.0
dtype: float64

In [7]:
data.values

array([0.1, 1.5, 2. , 2.7, 3. ])

In [8]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
data[2]=2.5
data

0    0.1
1    1.5
2    2.5
3    2.7
4    3.0
dtype: float64

In [13]:
#2
data = pd.Series([0.1, 1.5, 2, 2.7, 3], index=['a', 'b', 'c','d', 'e'])
data

a    0.1
b    1.5
c    2.0
d    2.7
e    3.0
dtype: float64

In [14]:
data = pd.Series([0.1, 1.5, 2, 2.7, 3], index=['7', '3', '5','4', '2'])
data

7    0.1
3    1.5
5    2.0
4    2.7
2    3.0
dtype: float64

In [15]:
data[2]=2.5
data

7    0.1
3    1.5
5    2.5
4    2.7
2    3.0
dtype: float64

In [58]:
#3
football_club = {'Pele':'MU', 'Ronaldo':'Chelsea', 'Messi':'Liverpool', 'Helen':'MU', 'Abramov':'Beshiktash'}
print(football_club)

{'Pele': 'MU', 'Ronaldo': 'Chelsea', 'Messi': 'Liverpool', 'Helen': 'MU', 'Abramov': 'Beshiktash'}

In [59]:
club = pd.Series(football_club)
club

Pele               MU
Ronaldo       Chelsea
Messi       Liverpool
Helen              MU
Abramov    Beshiktash
dtype: object

In [61]:
club['Messi':'Abramov']

Messi       Liverpool
Helen              MU
Abramov    Beshiktash
dtype: object

In [62]:
#4
skalyar= pd.Series(10, index=['a', 'b', 'c', 'd'])
skalyar

a    10
b    10
c    10
d    10
dtype: int64

In [70]:
#5
football_position = {'Pele':'Форвард', 'Ronaldo':'Оттянутый нападающий', 'Messi':'Вингер', 'Helen':'ЦOП', 'Abramov':'ЦП'}
print(football_position)

{'Pele': 'Форвард', 'Ronaldo': 'Оттянутый нападающий', 'Messi': 'Вингер', 'Helen': 'ЦOП', 'Abramov': 'ЦП'}

In [64]:
position=pd.Series(football_position)
position

Pele                    Форвард
Ronaldo    Оттянутый нападающий
Messi                    Вингер
Helen                       ЦOП
Abramov                      ЦП
dtype: object

In [72]:
football=pd.DataFrame({'Футбольный клуб': club, 'Позиция на поле': position})
football

        Футбольный клуб       Позиция на поле
Pele                 MU               Форвард
Ronaldo         Chelsea  Оттянутый нападающий
Messi         Liverpool                Вингер
Helen                MU                   ЦOП
Abramov      Beshiktash                    ЦП

In [73]:
#5
football['Позиция на поле'][1] = 'Lider'
football

        Футбольный клуб Позиция на поле
Pele                 MU         Форвард
Ronaldo         Chelsea           Lider
Messi         Liverpool          Вингер
Helen                MU             ЦOП
Abramov      Beshiktash              ЦП

In [21]:
#6
first = pd.Series([1, np.nan, 2, None, 'Hello', 'World'])
print(data)

0        1
1      NaN
2        2
3     None
4    Hello
5    World
dtype: object

In [22]:
first.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [26]:
first[first.notnull()]

0        1
2        2
4    Hello
5    World
dtype: object

In [27]:
first.dropna()

0        1
2        2
4    Hello
5    World
dtype: object

In [28]:
first.fillna(0)

0        1
1        0
2        2
3        0
4    Hello
5    World
dtype: object

In [3]:
#7
data = pd.DataFrame([[1, None, 5], [12, 8, np.nan], [6, 4, 3]])
data

    0    1    2
0   1  NaN  5.0
1  12  8.0  NaN
2   6  4.0  3.0

In [34]:
data.dropna()

   0    1    2
2  6  4.0  3.0

In [37]:
data.dropna(axis='columns')

    0
0   1
1  12
2   6

In [38]:
data.fillna(method='ffill')

    0    1    2
0   1  NaN  5.0
1  12  8.0  5.0
2   6  4.0  3.0

In [39]:
data.fillna(method='bfill')

    0    1    2
0   1  8.0  5.0
1  12  8.0  3.0
2   6  4.0  3.0

In [4]:
data.fillna(method='ffill', axis=1)

      0    1    2
0   1.0  1.0  5.0
1  12.0  8.0  8.0
2   6.0  4.0  3.0

In [5]:
data.fillna(method='bfill', axis=1)

      0    1    2
0   1.0  5.0  5.0
1  12.0  8.0  NaN
2   6.0  4.0  3.0